QGDsolver/tutorials/QGDFoam/2D/forwardStep/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1; 

vertices
(
    (  2.4 0.000000000        -0.01)   //0
    (  3.0 0.000000000        -0.01)   //1
    (  3.0 0.200000000        -0.01)   //2
    (  2.4 0.200000000        -0.01)   //3
    (  2.4 0.000000000         0.01)   //4
    (  3.0 0.000000000         0.01)   //5
    (  3.0 0.200000000         0.01)   //6
    (  2.4 0.200000000         0.01)   //7
    (  2.4 1.000000000        -0.01)   //8
    (  3.0 1.000000000        -0.01)   //9
    (  2.4 1.000000000         0.01)   //10
    (  3.0 1.000000000         0.01)   //11
    (  0.0 0.200000000        -0.01)   //12
    (  0.0 1.000000000        -0.01)   //13
    (  0.0 0.200000000         0.01)   //14
    (  0.0 1.000000000         0.01)   //15
);

blocks
(
    /*
     * Very coarse settings
     */
//    hex (0 1 2 3 4 5 6 7) (24 8 1) simpleGrading (1 1 1)
//    hex (3 2 9 8 7 6 11 10) (24 32 1) simpleGrading (1 1 1)
//    hex (12 3 8 13 14 7 10 15) (96 32 1) simpleGrading (1 1 1)

    /*
     * Coarse settings
     */
    hex (0 1 2 3 4 5 6 7) (48 16 1) simpleGrading (1 1 1)
    hex (3 2 9 8 7 6 11 10) (48 64 1) simpleGrading (1 1 1)
    hex (12 3 8 13 14 7 10 15) (192 64 1) simpleGrading (1 1 1)

    /*
     * Medium
     */
//    hex (0 1 2 3 4 5 6 7) (96 32 1) simpleGrading (1 1 1)
//    hex (3 2 9 8 7 6 11 10) (96 128 1) simpleGrading (1 1 1)
//    hex (12 3 8 13 14 7 10 15) (384 128 1) simpleGrading (1 1 1)

    /*
     * Fine
     */
//    hex (0 1 2 3 4 5 6 7) (384 128 1) simpleGrading (1 1 1)
//    hex (3 2 9 8 7 6 11 10) (384 512 1) simpleGrading (1 1 1)
//    hex (12 3 8 13 14 7 10 15) (1536 512 1) simpleGrading (1 1 1)

    /*
     *  Very fine
     */
//    hex (0 1 2 3 4 5 6 7) (768 256 1) simpleGrading (1 1 1)
//    hex (3 2 9 8 7 6 11 10) (768 1024 1) simpleGrading (1 1 1)
//    hex (12 3 8 13 14 7 10 15) (3072 1024 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
            (2 9 11 6)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (12 13 15 14)
        );
    }
    axes
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (13 8 10 15)
            (8 9 11 10)
        );
    }
    walls
    {
        type wall;
        faces
        (
            
            
            (12 3 7 14)
            (0 4 7 3)
        );
    }
    empty1
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (3 2 9 8)
            (12 3 8 13)
        );
    }
    empty2
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (7 6 11 10)
            (14 7 10 15)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
